# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [6]:
# Your code here
cur.execute('''SELECT lastName, firstName FROM employees JOIN offices USING (officeCode) WHERE city = 'Boston' ''')

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
# Your code here
cur.execute('''SELECT e.employeeNumber, o.officeCode, o.city  
               FROM offices AS o
               LEFT JOIN employees AS e
               USING (officeCode) 
               GROUP BY officeCode 
               HAVING COUNT(e.employeeNumber) = 0''')

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

  employeeNumber  officeCode    city
0           None          27  Boston

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [20]:
# Your code here
cur.execute('''SELECT e.employeeNumber, p.productName
               FROM employees AS e
               JOIN customers AS c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders AS o
               USING (customerNumber)
               JOIN orderdetails AS od
               USING (orderNumber)
               JOIN products AS p
               USING (productCode)
               
               ''')

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df

      employeeNumber                                  productName
0               1165                               1958 Setra Bus
1               1165                       1940 Ford Pickup Truck
2               1165                      1939 Cadillac Limousine
3               1165  1996 Peterbilt 379 Stake Bed with Outrigger
4               1165                            1968 Ford Mustang
...              ...                                          ...
2991            1702                  1954 Greyhound Scenicruiser
2992            1702       1950's Chicago Surface Lines Streetcar
2993            1702             Diamond T620 Semi-Skirted Tanker
2994            1702                           1911 Ford Town Car
2995            1702             1936 Mercedes Benz 500k Roadster

[2996 rows x 2 columns]

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!